{
  "meta": {
    "theme": "even"
  },
  "basics": {
    "name": "Halil Bozdogan",
    "label": "Senior DevOps Engineer",
    "email": "halilbozdogan@gmail.com",
    "image": "https://www.halilbozdogan.com/images/avatar.jpeg",
    "url": "https://www.halilbozdogan.com",
    "location": {
      "city": "Ankara",
      "region": "Ankara",
      "countryCode": "TR"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "hll_bzdgn",
        "url": "https://twitter.com/hll_bzdgn"
      },
      {
        "network": "GitHub",
        "username": "halilbozdogan",
        "url": "https://github.com/halilbozdogan"
      },
      {
        "network": "LinkedIn",
        "username": "halilbozdogan",
        "url": "https://www.linkedin.com/in/halilbozdogan/"
      }
    ],
    "summary": "Experienced Senior DevOps Engineer with a strong background in software engineering, infrastructure automation, and cloud-native transformations. Skilled in building scalable systems, optimizing CI/CD pipelines, and managing containerized applications on Kubernetes. Proven record of improving performance, reliability, and developer productivity across complex environments."
  },
  "work": [
    {
      "name": "Nesine",
      "position": "Senior DevOps Engineer",
      "location": "Istanbul, Turkey",
      "url": "https://www.nesine.com",
      "startDate": "2023-05",
      "summary": "Senior DevOps Engineer at Nesine, the largest legal online betting provider in Turkey, leading modernization and automation initiatives across CI/CD, observability, and infrastructure.",
      "highlights": [
        "Led the full migration from VM-based deployments to Kubernetes using Docker Buildx (Bake), Octopus Deploy, TeamCity, and custom deployment automation scripts.",
        "Implemented and managed Octopus Kubernetes Agents, enabling environment-specific deployments and streamlined release processes.",
        "Deployed and integrated GitLab Kubernetes Runners with Docker Buildx, providing isolated, scalable, and pod-based CI/CD execution.",
        "Developed New Relic dashboards for real-time visibility into system performance and reliability, monitoring high-traffic services processing up to 70K requests per second across 4–8 pods (3 CPU / 4 GB each).",
        "Built custom NGINX reverse-proxy deployments for microservices to enhance caching, routing, and centralized logging.",
        "Developed a Blazor-based internal monitoring application to track Octopus Deploy pipelines and TeamCity build statuses.",
        "Deployed and configured self-hosted Sentry for frontend teams to monitor and debug React applications effectively.",
        "Integrated SonarQube with TeamCity pipelines to enforce Quality Gates and ensure build integrity based on static analysis results."
      ]
    },
    {
      "name": "Enocta",
      "position": "Senior Software Engineer",
      "location": "Ankara, Turkey",
      "url": "https://www.linkedin.com/company/enocta/",
      "startDate": "2022-07",
      "endDate": "2023-04",
      "summary": "Senior Software Engineer focusing on backend performance, CI/CD improvements, and modernization of internal development practices.",
      "highlights": [
        "Identified and resolved performance issues in core Web API services.",
        "Designed and implemented new features to support multi-timezone operations for international users.",
        "Migrated source control from TFS to Git, improving development collaboration and productivity.",
        "Implemented CI/CD pipelines on Azure DevOps to automate build and release workflows."
      ]
    },
    {
      "name": "Tiga Bilgi Teknolojileri A.S.",
      "position": "Senior Software Engineer",
      "location": "Ankara, Turkey",
      "url": "https://www.linkedin.com/company/tigahealth/",
      "startDate": "2015-12",
      "endDate": "2022-11",
      "summary": "Technical leader for large-scale government software projects, specializing in system architecture, high availability, and performance optimization.",
      "highlights": [
        "Architected and developed high-availability and fault-tolerant systems for public sector applications.",
        "Modernized legacy .NET Core applications by migrating from 2.x to LTS versions.",
        "Optimized large and complex codebases to improve performance and maintainability.",
        "Established CI/CD workflows with TFS and on-premises Kubernetes clusters.",
        "Containerized Windows Service applications using Docker and deployed to Kubernetes.",
        "Led code quality and security reviews to ensure compliance with internal and external standards."
      ]
    },
    {
      "name": "CLF IT & Management Consulting",
      "position": "Senior Software Engineer",
      "url": "https://www.linkedin.com/company/clf-it-&-management-consulting/",
      "startDate": "2014-04",
      "endDate": "2015-10",
      "summary": "Senior Software Engineer contributing to secure, high-performance systems for defense and government clients.",
      "highlights": [
        "Developed a high-performance non-blocking web server for custom messaging integrations.",
        "Obtained security clearance for classified military projects.",
        "Collaborated closely with clients to design resilient, scalable systems."
      ]
    },
    {
      "name": "Anadolu Agency",
      "position": "Software Engineer",
      "url": "https://www.linkedin.com/company/anadoluajansi/",
      "startDate": "2013-12",
      "endDate": "2014-02",
      "summary": "Software Engineer building integration services for Anadolu Agency’s national news infrastructure.",
      "highlights": [
        "Designed and implemented Windows and web services for integrating third-party systems into Anadolu Agency’s national news infrastructure."
      ]
    },
    {
      "name": "Innova",
      "position": "Application Development Consultant",
      "location": "Ankara, Turkey",
      "url": "https://www.linkedin.com/company/innova/",
      "startDate": "2008-09",
      "endDate": "2013-12",
      "summary": "Application Development Consultant responsible for enterprise application design, shared frameworks, and mentoring junior developers.",
      "highlights": [
        "Conducted requirements analysis and system design for enterprise applications.",
        "Trained interns and junior developers in best practices and coding standards.",
        "Developed shared frameworks and optimized legacy libraries for performance.",
        "Analyzed and remediated security vulnerabilities identified in audit reports."
      ]
    },
    {
      "name": "Demir Export A.S.",
      "position": "System Support Chief",
      "url": "https://www.linkedin.com/company/demir-export-a-/",
      "startDate": "2007-10",
      "endDate": "2008-08",
      "summary": "System Support Chief managing core infrastructure for Demir Export.",
      "highlights": [
        "Administered Windows Server and Active Directory infrastructure.",
        "Deployed and customized SharePoint-based collaboration environments."
      ]
    }
  ],
  "projects": [
    {
      "name": "National Health System - e-Nabiz",
      "startDate": "2020-12",
      "endDate": "2020-12",
      "url": "https://www.enabiz.gov.tr",
      "summary": "National health platform collecting and serving patient treatment data and healthcare information across Turkey.",
      "highlights": [
        "Collected patient treatments and visits from healthcare providers across Turkey.",
        "Displayed laboratory results, prescriptions, and treatment details to individuals via the e-Nabiz portal.",
        "Handled over 1 million daily requests from healthcare providers.",
        "Stored over 6 million patient data entries in a NoSQL (Couchbase) database with more than 20TB capacity.",
        "Operated 150+ servers running Couchbase clusters with a high-availability setup serving the e-Nabiz Portal.",
        "Integrated with internal and external systems, including diagnostic imaging services.",
        "Migrated legacy Windows Service applications to Docker containers.",
        "Configured key Kubernetes components, including MetalLB, NGINX-Ingress, and Harbor Registry."
      ],
      "keywords": [
        "Couchbase",
        "NoSQL",
        "Kubernetes",
        "Docker",
        "MetalLB",
        "NGINX-Ingress",
        "Harbor Registry",
        "High Availability"
      ]
    },
    {
      "name": "Ministry of Youth and Sports - E-Transition System",
      "startDate": "2019-04",
      "endDate": "2019-12",
      "url": "https://www.gsb.gov.tr",
      "summary": "Digital transformation project for the Ministry of Youth and Sports.",
      "highlights": [
        "Digitized ministry operations to reduce paperwork and improve internal correspondence.",
        "Identified bottlenecks in legacy code and improved performance.",
        "Developed reports for multiple modules.",
        "Supported junior staff during development and implementation."
      ],
      "keywords": [
        "Digital Transformation",
        "Legacy Modernization",
        "Reporting"
      ]
    },
    {
      "name": "Turkey Scholarships Application System",
      "startDate": "2015-12",
      "endDate": "2016-11",
      "url": "https://tbbs.turkiyeburslari.gov.tr",
      "summary": "Government scholarship application platform for international students.",
      "highlights": [
        "Enabled international students to apply, track applications, and receive notifications.",
        "Implemented Azure Cloud-based architecture using WebApps, Functions, and SQL Database.",
        "Integrated with external systems for academic tracking, arrivals/departures, and law enforcement checks.",
        "Handled over 150,000 scholarship applications within a single month in 2019.",
        "Implemented performance monitoring and diagnostics using Application Insights.",
        "Developed complex and detailed filtering capabilities for decision-makers."
      ],
      "keywords": [
        "Azure",
        "WebApps",
        "Azure Functions",
        "Azure SQL Database",
        "Application Insights",
        "Service-Based Architecture"
      ]
    },
    {
      "name": "Internal Company Portal for HR and Finance",
      "startDate": "2015-01",
      "endDate": "2015-10",
      "summary": "Internal portal for HR and Finance workflows, record keeping, and reporting.",
      "highlights": [
        "Simplified HR and Finance workflows, record keeping, and reporting.",
        "Conducted requirement analysis and technology selection for scalability and low TCO.",
        "Developed reusable Security and Auditing modules as libraries."
      ],
      "keywords": ["HR", "Finance", "Security", "Auditing"]
    },
    {
      "name": "Network Device Monitoring and Management",
      "startDate": "2014-04",
      "endDate": "2015-10",
      "summary": "Centralized monitoring and management of network devices for the Turkish Armed Forces.",
      "highlights": [
        "Monitored and managed 1000+ devices from a central location.",
        "Analyzed customer bug reports and field experiences to identify bottlenecks.",
        "Optimized legacy code for performance and reliability.",
        "Adopted new technologies to improve system reliability."
      ],
      "keywords": [
        "Network Monitoring",
        "Performance Optimization",
        "Reliability"
      ]
    },
    {
      "name": "Central Bank of the Republic of Turkey Service Integration",
      "startDate": "2013-12",
      "endDate": "2014-02",
      "url": "https://www.aafinans.com",
      "summary": "Integration between CBRT Announcement Service and Anadolu Agency Finance Data Portal.",
      "highlights": [
        "Integrated CBRT Announcement Service (Reuters Marketlink based) with Anadolu Agency Finance Data Portal.",
        "Analyzed Reuters Marketlink RS232 serial message protocol and template update system.",
        "Received update messages from serial ports and applied them to correct announcement templates.",
        "Maintained version history and displayed announcements on the web portal."
      ],
      "keywords": ["Integration", "RS232", "Marketlink", "Financial Data"]
    }
  ],
  "education": [
    {
      "institution": "Hacettepe University",
      "area": "Computer Education and Instructional Technologies",
      "studyType": "Bachelor's Degree",
      "startDate": "2001-12",
      "endDate": "2005-12",
      "score": "3.13 / 4.0"
    }
  ],
  "skills": [
    {
      "name": "DevOps & Cloud-Native",
      "keywords": [
        "Kubernetes",
        "Docker",
        "Docker Buildx",
        "Octopus Deploy",
        "TeamCity",
        "GitLab CI",
        "Azure DevOps",
        "Kubernetes Runners",
        "Infrastructure Automation"
      ]
    },
    {
      "name": "Backend & .NET",
      "keywords": [
        ".NET",
        ".NET Core",
        "Web API",
        "High Availability",
        "Performance Optimization"
      ]
    },
    {
      "name": "Observability & Quality",
      "keywords": [
        "New Relic",
        "Application Insights",
        "Sentry",
        "SonarQube",
        "Logging",
        "Monitoring",
        "Quality Gates"
      ]
    }
  ],
  "languages": [
    {
      "language": "Turkish",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "certificates": [
    {
      "name": "Certified Kubernetes Administrator (CKA)",
      "issuer": "The Linux Foundation",
      "date": "2024-12",
      "url": "https://training.linuxfoundation.org/certification/certified-kubernetes-administrator-cka/",
      "id": "LF-ghiurlz7an"
    }
  ]
}
